package 복습;

public class 아무거나2 {
	public static void main(String[] args) {
//		1. 기본형 형변환 중, 아래 코드를 수정해보세요.
//		   int x = 100;
//		   byte y = x;
		   int x = 100;
		   byte y = (byte)x;
		
//		2. 참조형 형변환이 되는 조건은?
//		   형변환은 변환되는 참조형이 상속관계일때만 형변환이 가능하다
		   
//		3. 상속에서 위에 물려주는 클래스를 무엇이라고 부르는가?
//		   부모 클래스, 슈퍼 클래프
		   
//		4. 상속에서 아래 물려받는 클래스를 무엇이라고 부르는가?
//			자식 클래스, 서브 클래스
		   
//		5. 상속을 사용할 때 키워드는 다음중 무엇? 1) extend 2) extends 3) implements
//		    extends
		   
//		6. 기본형 데이터 4가지
//		   정수형, 실수형, 문자형, 논리형
		   
//		7. 참조형 데이터 2가지 이상
//		   배열, 클래스
		   
//		8. 참조형 형변환 중, 아래 코드를 수정해보세요.
//		   Car c = new Car();			//크다
//		   Truck t = new Truck(); //작다, Truck은 Car를 상속받아 만들었음
//		   t = (Truck)c; //수정해보세요.
		   
		   
//		9. 기본형, 참조형 변수에 각각 들어있는 것은?
//		   기본형 : 값
//		   참조형 : 주소
		   
//		10. 참조형 변수를 초기화하려고 한다. 무엇으로 초기화해야할까?
//		   참조형은 null로 초기화 해야합니다.
		   
//		11. null이란?
//		   주소가 없다라는 개념
		   
//		12. 포장클래스(랩퍼클래스)란? 종류 2가지
//			>> 기본형을 클래스로 만들어 놓은것을 포장 클래스라고 한다.
//		   Integer, Double, Boolean, Character

//		13. 업캐스팅이란?
//		   부모클래스로 자식 클래스의 타입을 형변환 하는것 
//		   ex) Object(크다) << 업캐스팅 << String(작다), 자동형변환
		   
//		14. 다운캐스팅이란?
//		   자식클래스로 부모클래스의 타입을 형변환 하는것
//		   ex) Object(크다) >> 다운캐스팅 >> String(작다), 강제형변환
		  
	}
}
